package day23;
/*
*   第一题：
*       编写程序，使用一维数组，模拟栈数据结构
*       要求：
*           1、这个站可以存储java中的任何引用类型的数据
*           2、在栈中提供push方法模拟压栈（栈满了，要有提示信息）
*           3、在栈中提供pop方法模拟弹栈（栈空了，也要有提示信息）
*           4、编写测试程序，new栈对象，调用push，pop方法来模拟压栈弹栈的动作
*
*       public class MyStack{//栈类
*           //提供一个数组来存储栈中的元素
*           Object[] elements;
*
*           //构造方法
*
*           push方法（push方法压栈）
*           压栈表示栈中多一个元素
*           但是栈如果已满，压栈失败
*           这个方法的参数以及返回值类型自己定义
*
*           pop方法（pop方法弹栈）
*           弹栈表示栈中少一个元素
*           但是栈如果已空，弹栈失败
*           这个方法的参数以及返回值类型自己定义
*       }
* */
public class MyStack {

}
